"""
Написать функцию host_range_ping_tab(), возможности которой основаны на функции из
примера 2. Но в данном случае результат должен быть итоговым по всем ip-адресам,
представленным в табличном формате (использовать модуль tabulate). Таблица должна
состоять из двух колонок и выглядеть примерно так:
Reachable       Unreachable
-------------   -------------
10.0.0.1        10.0.0.3
10.0.0.2        10.0.0.4
"""
from tabulate import tabulate
from task_2 import host_range_ping


def host_range_ping_tab():
    result = host_range_ping()
    print()
    print(tabulate(result, headers="keys", tablefmt="rounded_grid", stralign="center"))


if __name__ == "__main__":
    host_range_ping_tab()

"""
Введите ip-адрес: 217.77.52.100
Какое количество адресов проверить? 4
Узел 217.77.52.100 Доступен
Узел 217.77.52.101 Недоступен
Узел 217.77.52.102 Доступен
Узел 217.77.52.103 Недоступен

╭───────────────┬───────────────╮
│   Доступен    │  Недоступен   │
├───────────────┼───────────────┤
│ 217.77.52.100 │ 217.77.52.101 │
├───────────────┼───────────────┤
│ 217.77.52.102 │ 217.77.52.103 │
╰───────────────┴───────────────╯
"""
